# Конспект по 3леции+семинар
- Git - одна из систем контроля версий
- GitHub - Сервис компании Майкрософт для
организации работы удаленных репозиториев
- Удаленный репозиторий - это версии проекта, сохраненные на удаленном сервере, конкретно на GitHub'e .

**Чтобы начать работу, необходимо локальный сервер синхранизировать с удаленным, для этого клонируем удаленный репозиторий или создаем fork**
- git clone 'ссылка' - клонирует из GitHub удаленный репозиторий на ваш компьютер.
- *Fork* - функция, с помощью которой мы копируем чужой репозиторий.
- git pull используется для синхронизации локальной рабочей копии с удаленным репозиторием.
- git push - загружает изменения из локальной версии в удаленный репозиторий.
## Важные дополнения
- После клонирования удаленного репозитория на локальный компьютер нужно создать новую ветку и работать в ней.
- При работе с побочной веткой git push происходит через дополнительную команду git push set up stream origin, которая позволяет отправить запрос через отдельную ветку на дополнение файла.
- Зайти на страницу копии репозитория и нажать на кнопку "Compare & Pull Request". Откроется страница, на которой можно ввести название и описание изменений. После проверки изменений нужно нажать на кнопку "Create pull request".